; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors
(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)
(:predicates
        (robot-at ?r - robot ?x - tile)
        (up ?x - tile ?y - tile)
        (down ?x - tile ?y - tile)
        (right ?x - tile ?y - tile)
        (left ?x - tile ?y - tile)
        (clear ?x - tile)
        (painted ?x - tile ?c - color)
        (robot-has ?r - robot ?c - color)
        (available-color ?c - color)
        (free-color ?r - robot))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)
(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)
(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)
; Robot movements
(:action up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
(:action left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)
)

; problem
(define (problem instance1)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 
           tile_1-1 tile_1-2 tile_1-3 
           tile_2-1 tile_2-2 tile_2-3 
           tile_3-1 tile_3-2 tile_3-3 - tile
           robot1 - robot
           white black - color
)
 (:init 

   (robot-at robot1 tile_3-1)
   (robot-has robot1 white)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_0-3)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_1-3)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_2-3)
   (clear tile_3-2)
   (clear tile_3-3)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
))
 
)

; plan
1. (down robot1 tile_3-1 tile_2-1)
   deleted: (robot-at robot1 tile_3-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_3-1)
   goals met: 0 of 9
2. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 1 of 9
3. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 1 of 9
4. (right robot1 tile_2-1 tile_2-2)
   deleted: (robot-at robot1 tile_2-1) (clear tile_2-2)
   added: (robot-at robot1 tile_2-2) (clear tile_2-1)
   goals met: 1 of 9
5. (paint-up robot1 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 2 of 9
6. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 2 of 9
7. (right robot1 tile_2-2 tile_2-3)
   deleted: (robot-at robot1 tile_2-2) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_2-2)
   goals met: 2 of 9
8. (paint-up robot1 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 3 of 9
9. (down robot1 tile_2-3 tile_1-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_2-3)
   goals met: 3 of 9
10. (left robot1 tile_1-3 tile_1-2)
   deleted: (robot-at robot1 tile_1-3) (clear tile_1-2)
   added: (robot-at robot1 tile_1-2) (clear tile_1-3)
   goals met: 3 of 9
11. (paint-up robot1 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 4 of 9
12. (down robot1 tile_1-2 tile_0-2)
   deleted: (robot-at robot1 tile_1-2) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_1-2)
   goals met: 4 of 9
13. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 9
14. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 5 of 9
15. (left robot1 tile_0-2 tile_0-1)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_0-2)
   goals met: 5 of 9
16. (up robot1 tile_0-1 tile_1-1)
   deleted: (robot-at robot1 tile_0-1) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_0-1)
   goals met: 5 of 9
17. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 6 of 9
18. (down robot1 tile_1-1 tile_0-1)
   deleted: (robot-at robot1 tile_1-1) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_1-1)
   goals met: 6 of 9
19. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 6 of 9
20. (paint-up robot1 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 7 of 9
21. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 7 of 9
22. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 7 of 9
23. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 7 of 9
24. (up robot1 tile_0-3 tile_1-3)
   deleted: (robot-at robot1 tile_0-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_0-3)
   goals met: 7 of 9
25. (paint-up robot1 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 8 of 9
26. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 8 of 9
27. (down robot1 tile_1-3 tile_0-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_1-3)
   goals met: 8 of 9
28. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 9 of 9
